{
    "control_buffer": 34,
    "control_time": 35,
    "process_proccreate_name": 66,
    "thread_thcreate": 63,
    "thread_thready": 3,
    "thread_threceive": 6,
    "thread_thsigwaitinfo": 51,
    "process_procthread_name": 67,
    "thread_thnanosleep": 37,
    "thread_threply": 15,
    "thread_thrunning": 1,
    "thread_thcondvar": 33,
    "ker_call_msg_send": 13,
    "comm_snd_message": 11,
    "comm_rec_message": 14,
    "ker_exit_msg_receive": 4,
    "ker_call_msg_reply": 17,
    "comm_reply_message": 18,
    "ker_exit_msg_reply": 16,
    "ker_call_msg_receive": 5,
    "comm_rec_pulse": 10,
    "int_entr": 19,
    "int_handler_entr": 7,
    "int_handler_exit": 8,
    "comm_snd_pulse_exe": 2,
    "int_exit": 20,
    "usrevent_event": 9,
    "ker_call_connect_client_info": 22,
    "ker_exit_connect_client_info": 21,
    "ker_call_msg_write": 28,
    "ker_exit_msg_write": 27,
    "ker_exit_msg_send": 12,
    "ker_call_signal_procmask": 26,
    "ker_exit_signal_procmask": 25,
    "ker_call_msg_send_pulse": 41,
    "comm_snd_pulse": 42,
    "ker_exit_msg_send_pulse": 40,
    "ker_call_sync_condvar_signal": 32,
    "ker_exit_sync_condvar_sig": 31,
    "ker_exit_sync_condvar_wait": 29,
    "ker_call_msg_read": 24,
    "ker_exit_msg_read": 23,
    "thread_thwaitpage": 36,
    "ker_call_sync_condvar_wait": 30,
    "ker_call_timer_timeout": 38,
    "thread_thsend": 52,
    "ker_call_msg_info": 44,
    "ker_exit_msg_info": 45,
    "ker_call_msg_current": 46,
    "ker_exit_msg_current": 43,
    "ker_exit_timer_timeout": 39,
    "ker_call_msg_error": 60,
    "comm_msg_error": 61,
    "ker_exit_msg_error": 59,
    "ker_call_signal_waitinfo": 55,
    "ker_call_msg_deliver_event": 58,
    "ker_exit_msg_deliver_event": 57,
    "ker_exit_signal_waitinfo": 56,
    "ker_call_msg_sendvnc": 54,
    "ker_exit_msg_sendvnc": 53,
    "ker_call_connect_attach": 48,
    "ker_exit_connect_attach": 47,
    "system_pathmgr_open": 62,
    "ker_call_connect_detach": 50,
    "ker_exit_connect_detach": 49,
    "ker_call_connect_flags": 65,
    "ker_exit_connect_flags": 64,
    "ker_call_sync_mutex_lock": 68,
    "thread_thmutex": 69,
    "ker_call_sync_mutex_unlock": 70,
    "ker_exit_sync_mutex_lock": 71,
    "ker_exit_sync_mutex_unlock": 72
}