{
    "usrevent_event": 9,
    "ker_call_msg_receive": 5,
    "comm_rec_pulse": 10,
    "ker_exit_msg_receive": 4,
    "thread_threceive": 6,
    "thread_thrunning": 1,
    "ker_exit_msg_send": 17,
    "ker_call_msg_send": 18,
    "comm_snd_message": 11,
    "thread_threply": 13,
    "comm_rec_message": 12,
    "int_entr": 19,
    "int_handler_entr": 7,
    "int_handler_exit": 8,
    "comm_snd_pulse_exe": 2,
    "int_exit": 20,
    "ker_call_connect_client_info": 22,
    "ker_exit_connect_client_info": 21,
    "ker_call_msg_reply": 15,
    "comm_reply_message": 16,
    "thread_thready": 3,
    "ker_exit_msg_reply": 14,
    "ker_exit_timer_timeout": 40,
    "ker_call_msg_sendvnc": 43,
    "ker_exit_msg_sendvnc": 42,
    "ker_call_signal_waitinfo": 57,
    "thread_thsigwaitinfo": 61,
    "ker_call_connect_detach": 36,
    "comm_snd_pulse_dis": 62,
    "control_buffer": 32,
    "control_time": 33,
    "ker_call_sync_condvar_signal": 28,
    "ker_exit_sync_condvar_sig": 27,
    "ker_exit_sync_condvar_wait": 29,
    "ker_call_msg_read": 24,
    "ker_exit_msg_read": 23,
    "thread_thwaitpage": 34,
    "ker_call_sync_condvar_wait": 30,
    "thread_thcondvar": 31,
    "ker_exit_connect_detach": 35,
    "ker_call_msg_send_pulse": 53,
    "comm_snd_pulse": 54,
    "ker_exit_msg_send_pulse": 52,
    "ker_call_msg_deliver_event": 60,
    "ker_exit_msg_deliver_event": 59,
    "ker_call_msg_error": 50,
    "comm_msg_error": 51,
    "ker_exit_msg_error": 49,
    "ker_exit_signal_waitinfo": 58,
    "ker_call_msg_write": 26,
    "ker_exit_msg_write": 25,
    "ker_call_timer_timeout": 39,
    "thread_thnanosleep": 41,
    "ker_call_connect_attach": 38,
    "ker_exit_connect_attach": 37,
    "system_pathmgr_open": 48,
    "ker_call_sched_get": 67,
    "ker_exit_sched_get": 68,
    "ker_call_msg_info": 44,
    "ker_exit_msg_info": 45,
    "ker_call_msg_current": 47,
    "ker_exit_msg_current": 46,
    "thread_thsend": 65,
    "ker_call_sync_mutex_lock": 78,
    "thread_thmutex": 88,
    "ker_call_sync_mutex_unlock": 89,
    "ker_exit_sync_mutex_lock": 79,
    "ker_exit_sync_mutex_unlock": 90,
    "ker_call_thread_destroy": 103,
    "ker_exit_thread_destroy": 104,
    "ker_call_thread_destroyall": 82,
    "thread_thdestroy": 83,
    "thread_thdead": 84,
    "ker_call_thread_create": 85,
    "thread_thcreate": 66,
    "thread_thwaitthread": 86,
    "ker_call_signal_action": 56,
    "ker_exit_signal_action": 55,
    "ker_call_signal_procmask": 69,
    "ker_exit_signal_procmask": 70,
    "ker_call_connect_server_info": 74,
    "ker_exit_connect_server_info": 75,
    "ker_exit_thread_create": 87,
    "system_munmap": 93,
    "comm_signal": 100,
    "int_call_ker_signal_suspend": 105,
    "process_procdestroy": 94,
    "ker_call_signal_return": 101,
    "ker_exit_signal_return": 102,
    "process_proccreate": 95,
    "process_proccreate_name": 73,
    "int_call_ker_msg_send": 96,
    "ker_call_sync_create": 71,
    "ker_exit_sync_create": 72,
    "ker_call_signal_suspend": 106,
    "thread_thsigsuspend": 107,
    "ker_call_thread_ctl": 108,
    "ker_exit_thread_ctl": 109,
    "ker_call_connect_flags": 64,
    "ker_exit_connect_flags": 63,
    "system_mmap": 76,
    "system_mapname": 97,
    "ker_call_sched_set": 110,
    "ker_exit_sched_set": 111,
    "ker_call_sys_cpupage_get": 80,
    "ker_exit_sys_cpupage_get": 81,
    "ker_call_sys_cpupage_set": 112,
    "ker_exit_sys_cpupage_set": 113,
    "ker_call_sync_destroy": 114,
    "ker_exit_sync_destroy": 115,
    "ker_call_interrupt_unmask": 98,
    "ker_exit_interrupt_unmask": 99,
    "ker_call_timer_settime": 91,
    "ker_exit_timer_settime": 92,
    "ker_exit_msg_receivepulse": 116,
    "ker_call_msg_receivepulse": 117,
    "process_procthread_name": 77
}