{
    "control_buffer": 34,
    "control_time": 33,
    "process_proccreate_name": 79,
    "thread_thcreate": 63,
    "thread_thready": 3,
    "thread_threceive": 6,
    "thread_thsigwaitinfo": 62,
    "process_procthread_name": 85,
    "thread_thnanosleep": 42,
    "thread_threply": 12,
    "thread_thrunning": 1,
    "thread_thcondvar": 39,
    "thread_thsigsuspend": 108,
    "ker_call_msg_send": 17,
    "comm_snd_message": 10,
    "comm_rec_message": 11,
    "ker_exit_msg_receive": 4,
    "int_entr": 19,
    "int_handler_entr": 7,
    "int_handler_exit": 8,
    "comm_snd_pulse_exe": 2,
    "int_exit": 20,
    "ker_call_msg_reply": 15,
    "comm_reply_message": 16,
    "ker_exit_msg_reply": 14,
    "ker_call_msg_receive": 5,
    "comm_rec_pulse": 13,
    "usrevent_event": 9,
    "ker_exit_timer_timeout": 41,
    "ker_call_connect_client_info": 22,
    "ker_exit_connect_client_info": 21,
    "ker_call_msg_write": 28,
    "ker_exit_msg_write": 27,
    "ker_exit_msg_send": 18,
    "ker_call_timer_timeout": 40,
    "ker_call_sync_condvar_signal": 36,
    "ker_exit_sync_condvar_sig": 35,
    "ker_exit_sync_condvar_wait": 37,
    "ker_call_msg_read": 24,
    "ker_exit_msg_read": 23,
    "thread_thwaitpage": 43,
    "ker_call_sync_condvar_wait": 38,
    "ker_call_msg_error": 50,
    "comm_msg_error": 51,
    "ker_exit_msg_error": 49,
    "thread_thsend": 54,
    "ker_call_msg_deliver_event": 67,
    "ker_exit_msg_deliver_event": 66,
    "ker_call_signal_waitinfo": 64,
    "ker_exit_signal_waitinfo": 65,
    "ker_call_timer_settime": 93,
    "ker_exit_timer_settime": 94,
    "ker_call_msg_sendvnc": 26,
    "ker_exit_msg_sendvnc": 25,
    "ker_call_msg_send_pulse": 56,
    "comm_snd_pulse": 57,
    "ker_exit_msg_send_pulse": 58,
    "ker_call_interrupt_unmask": 112,
    "ker_exit_interrupt_unmask": 113,
    "ker_call_connect_attach": 32,
    "ker_exit_connect_attach": 31,
    "system_pathmgr_open": 48,
    "ker_call_connect_detach": 30,
    "ker_exit_connect_detach": 29,
    "ker_call_connect_flags": 60,
    "ker_exit_connect_flags": 59,
    "ker_call_sync_mutex_lock": 75,
    "thread_thmutex": 80,
    "ker_call_sync_mutex_unlock": 81,
    "ker_exit_sync_mutex_lock": 76,
    "ker_exit_sync_mutex_unlock": 82,
    "comm_signal": 99,
    "ker_call_signal_return": 100,
    "ker_exit_signal_return": 98,
    "ker_call_thread_destroy": 103,
    "ker_exit_thread_destroy": 104,
    "ker_call_thread_destroyall": 86,
    "thread_thdestroy": 87,
    "thread_thdead": 88,
    "ker_call_thread_create": 89,
    "thread_thwaitthread": 90,
    "ker_call_signal_action": 53,
    "ker_exit_signal_action": 52,
    "ker_call_signal_procmask": 71,
    "ker_exit_signal_procmask": 70,
    "ker_call_timer_alarm": 116,
    "ker_exit_timer_alarm": 117,
    "ker_call_connect_server_info": 77,
    "ker_exit_connect_server_info": 78,
    "ker_exit_thread_create": 91,
    "comm_snd_pulse_dis": 55,
    "system_munmap": 74,
    "int_call_ker_signal_suspend": 105,
    "ker_call_msg_info": 44,
    "ker_exit_msg_info": 45,
    "process_procdestroy": 96,
    "process_proccreate": 95,
    "ker_call_sched_get": 68,
    "ker_exit_sched_get": 69,
    "int_call_ker_msg_send": 97,
    "ker_call_sync_create": 72,
    "ker_exit_sync_create": 73,
    "ker_call_signal_suspend": 109,
    "ker_call_thread_ctl": 101,
    "ker_exit_thread_ctl": 102,
    "system_mmap": 61,
    "system_mapname": 92,
    "ker_call_sched_set": 110,
    "ker_exit_sched_set": 111,
    "ker_call_sys_cpupage_get": 83,
    "ker_exit_sys_cpupage_get": 84,
    "ker_call_sys_cpupage_set": 106,
    "ker_exit_sys_cpupage_set": 107,
    "ker_call_msg_receivepulse": 118,
    "ker_exit_msg_receivepulse": 119,
    "ker_call_sync_destroy": 114,
    "ker_exit_sync_destroy": 115,
    "ker_call_msg_current": 47,
    "ker_exit_msg_current": 46
}